IDEA StatiCa Open Model
ConcreteMemberDataEc2.BeamData Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Beam data
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public BeamDataEc2 BeamData { get; set; }
Public Property BeamData As BeamDataEc2
	Get
	Set
public:
property BeamDataEc2^ BeamData {
	BeamDataEc2^ get ();
	void set (BeamDataEc2^ value);
}
Property Value
Type: BeamDataEc2
See Also
Reference
ConcreteMemberDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace